updated diagram
